{
  "id": "1cfb7d50-7e0e-4219-b8d9-1e45853d997f",
  "siteName": "Dots",
  "domainUrl": "tomorrowsdots.com",
  "brandingPresets": [
    {
      "presetId": "1064c6a2-6dfb-4ff3-bd0f-b7a5e4fdc007",
      "brandIdentity": {
        "designSummary": "This brand design embraces a modern, minimalistic aesthetic characterized by a high-contrast black and white base palette punctuated by a vivid neon yellow accent. The layout is grid-based and modular, providing clear content separation and generous white space that enhances readability and visual hierarchy. Typography plays a central role, featuring bold, geometric sans-serif fonts with a clean and slightly technical feel, used in large uppercase headings and medium-weight body text. The neon yellow accent color is strategically applied to navigation backgrounds, call-to-action blocks, and highlighted sections, creating energetic focal points without overwhelming the design. UI components are minimal and functional, with simple black text and icons ensuring clarity and accessibility. Overall, the design conveys professionalism, modernity, and creative vibrancy, suitable for contemporary cultural institutions or brands seeking a bold yet clean visual identity.",
        "toneOfVoice": "Bold, modern, professional, and creative with a clear and confident personality.",
        "tones": [
          "bold",
          "modern",
          "minimal",
          "energetic",
          "professional",
          "clean",
          "accessible",
          "creative",
          "confident",
          "structured"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modernism"
          ],
          "supportingStyles": [
            "Modular Design",
            "High Contrast",
            "Geometric Typography"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#FFFFFF",
            "secondary": "#FFFFFF",
            "secondaryForeground": "#000000",
            "background": "#FFFFFF",
            "customColors": [
              {
                "name": "neonaccent",
                "value": "#E6FF00"
              },
              {
                "name": "foreground",
                "value": "#000000"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color predominantly for text, icons, and key UI elements on light backgrounds to ensure maximum readability. The 'secondary' color serves as the main background, providing a clean and open canvas. The 'neonAccent' color is reserved for highlighting important interactive elements such as navigation bars, call-to-action blocks, and featured content backgrounds, always paired with 'primary' for text to maintain strong contrast. Avoid using 'neonAccent' for text to preserve legibility. The 'primaryForeground' and 'secondaryForeground' colors ensure text and icons stand out clearly against their respective backgrounds. This palette balances high contrast with vibrant energy, supporting accessibility and user engagement.",
          "paletteAccessibilityNotes": "The combination of 'primary' text on 'secondary' background meets WCAG AA and AAA contrast standards for normal and large text. The 'neonAccent' background with 'primary' text also meets WCAG AA contrast requirements, ensuring readability for call-to-action areas. Black text on white background and vice versa provide optimal contrast. Care should be taken to avoid using 'neonAccent' for small text or low contrast elements to maintain accessibility compliance."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "barlow-medium",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "montserrat",
              "oswald",
              "avenir-lt-w01_85-heavy1475544"
            ],
            "headingsUsageGuide": "Use the heading font in uppercase or sentence case with large sizes to create a commanding presence. Pair headings with the paragraph font to maintain readability and balance. Maintain ample spacing around headings to enhance clarity. Use 'primary' color for headings on light backgrounds and 'primaryForeground' on dark backgrounds. Avoid using the neonAccent color for headings to preserve legibility.",
            "headingsAccessibilityNotes": "Headings in 'primary' color on 'secondary' background meet WCAG AA and AAA contrast standards. Large font sizes further improve accessibility."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "barlow-extralight",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "open sans",
              "poppins-v2",
              "nunito sans"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for body text, captions, and smaller UI elements. Maintain consistent line height and letter spacing for readability. Use 'primary' color for text on 'secondary' backgrounds and 'primaryForeground' on dark backgrounds. Avoid using neonAccent for body text to ensure contrast and legibility.",
            "paragraphsAccessibilityNotes": "Body text in 'primary' color on 'secondary' background meets WCAG AA contrast standards for normal text sizes. Larger text sizes meet AAA standards."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section uses large, bold headings anchored in the top third of the viewport, creating immediate visual impact. The text is left-aligned with generous white space around it, emphasizing clarity and focus. The neonAccent color is used as a background highlight behind key calls to action, contrasting with black text for readability. This placement draws the user's eye naturally from the top navigation down into the content."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.02em",
              "fontWeight": "800"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.03em",
              "fontWeight": "900"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.04em",
              "fontWeight": "900"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.06em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use white or neonAccent backgrounds with clear boundaries defined by spacing rather than borders. They maintain consistent padding and margin to separate content blocks, supporting a modular and clean layout. The neonAccent container backgrounds highlight featured content or calls to action, always paired with black text for contrast.",
          "images": "Images are presented in clean rectangular frames with no borders or shadows, maintaining a minimal and modern look. They are spaced generously from text and other elements to avoid clutter and maintain visual balance.",
          "buttons": "Buttons are minimal and functional, typically black with white text or white with black text depending on background context. The 'Get tickets' button uses a black background with white text for prominence. Links are often underlined black text on white or neonAccent backgrounds, maintaining clarity and accessibility."
        },
        "graphicElements": {
          "icons": "Icons are simple, monochromatic black line or solid shapes consistent with the minimalistic style. They are used sparingly in navigation and UI controls to support usability without visual clutter.",
          "illustrations": "No decorative illustrations are present; the design relies on photography and abstract art images for visual interest.",
          "stickers": "No sticker or badge style elements are used; emphasis is created through color blocks and typography."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752423056465-Screenshot%202025-07-13%20at%2019.10.38.png"
      ]
    },
    {
      "presetId": "1df44372-5020-435b-9b5c-87a61c3e679c",
      "brandIdentity": {
        "designSummary": "This design features a bold and playful aesthetic with a strong emphasis on a vibrant royal blue and soft pastel pink color palette set against a neutral off-white background. The typography combines chunky, slab-serif headings that convey friendliness and impact with clean, modern sans-serif body text for readability. The layout is spacious and modular, using generous padding and consistent grid alignment to create a balanced and inviting composition. Decorative scalloped shapes echo the cookie theme, adding whimsy and reinforcing brand identity without overwhelming the clean structure. Interactive elements like buttons and badges use the primary blue color prominently, ensuring clear calls to action and visual hierarchy. Overall, the design balances professionalism with fun, making it suitable for a wide range of e-commerce and lifestyle websites seeking a youthful and memorable brand presence.",
        "toneOfVoice": "Friendly, playful, energetic, and approachable with a modern and confident personality.",
        "tones": [
          "Playful",
          "Energetic",
          "Friendly",
          "Modern",
          "Confident",
          "Inviting",
          "Vibrant",
          "Clean",
          "Whimsical",
          "Approachable"
        ],
        "designStyle": {
          "primaryStyle": [
            "Modern",
            "Playful",
            "E-commerce"
          ],
          "supportingStyles": [
            "Minimalist",
            "Whimsical",
            "Bold Typography"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#0045F5",
            "primaryForeground": "#FFFFFF",
            "secondary": "#FFCCE7",
            "secondaryForeground": "#0045F5",
            "background": "#FFF9F9",
            "customColors": [
              {
                "name": "badgeblue",
                "value": "#0045F5"
              },
              {
                "name": "buttonbackground",
                "value": "#0045F5"
              },
              {
                "name": "buttontext",
                "value": "#FFCCE7"
              },
              {
                "name": "foreground",
                "value": "#0045F5"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color predominantly for interactive elements such as buttons, badges, and key headings to establish brand recognition and ensure strong visual impact. The 'primaryForeground' color should be used for text and icons placed on 'primary' backgrounds to maintain high contrast and readability. The 'secondary' color serves as a soft, playful background for product cards and decorative shapes, providing a gentle contrast to the 'primary' blue. Text on 'secondary' backgrounds should use the 'secondaryForeground' color to maintain legibility and brand consistency. The 'background' color is a neutral off-white that supports all other colors by providing a clean and unobtrusive canvas. Custom colors like 'badgeBlue' and 'buttonBackground' reinforce the primary brand color usage in specific UI components, while 'buttonText' offers a subtle contrast on buttons. This palette ensures accessibility and visual harmony across the site, balancing vibrancy with softness to create an inviting user experience.",
          "paletteAccessibilityNotes": "The 'primary' color (#0047FF) paired with 'primaryForeground' (#FFFFFF) meets WCAG AA standards for text and interactive elements, ensuring sufficient contrast for readability. The 'secondary' color (#FFCCE7) with 'secondaryForeground' (#0047FF) also meets WCAG AA contrast requirements for text on backgrounds. The 'background' color (#FFF9F9) provides a high-contrast base for both 'primary' and 'secondary' colors, supporting accessibility across the site. Buttons and badges using 'buttonBackground' (#0047FF) with 'buttonText' (#FFCCE7) maintain clear visibility and meet accessibility guidelines for interactive components."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "bitter",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "cormorantgaramond",
              "roboto-bold"
            ],
            "headingsUsageGuide": "Use the 'bitter' font for all major headings and calls to action to create a strong, friendly presence. Pair with the sans-serif paragraph font for contrast and readability. Maintain generous spacing around headings to emphasize their importance and ensure clarity. Use the 'primary' color for headings on light backgrounds and 'primaryForeground' on dark backgrounds to maximize contrast and accessibility.",
            "headingsAccessibilityNotes": "Headings in 'bitter' with 'primary' color on 'background' meet WCAG AA contrast standards, ensuring legibility for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "nunito sans",
              "raleway",
              "poppins-v2"
            ],
            "paragraphsUsageGuide": "Use 'open sans' for all body text, captions, and smaller UI text to ensure clarity and ease of reading. Pair with the bold 'bitter' headings to create a balanced typographic hierarchy. Maintain consistent line height and spacing for comfortable reading. Use 'primary' or 'secondary' colors for links and interactive text, ensuring they stand out without overwhelming the content.",
            "paragraphsAccessibilityNotes": "Body text in 'open sans' with 'primary' or 'secondaryForeground' colors on 'background' meets WCAG AA contrast requirements for normal and large text."
          },
          "welcomeSectionTypography": {
            "placement": "Centered",
            "implementation": "The welcome section uses a full-width background image with centrally aligned large, bold headings in the 'bitter' font. The text overlays the image with sufficient contrast ensured by a subtle dark overlay on the image. Calls to action are placed below the heading, using rounded buttons in the 'primary' color with 'buttonText' color text. This centered placement creates an immersive and inviting introduction, focusing user attention immediately on the brand message and key actions."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "600"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.07em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use soft pastel pink backgrounds or transparent backgrounds on the neutral off-white base. They have consistent padding and rounded corners, creating a friendly and approachable feel. Borders are minimal or absent, relying on color blocks and spacing for separation. The 'secondary' color is used for product card backgrounds, while the main page background remains neutral.",
          "images": "Images are clean, well-lit product photos with neutral backgrounds that complement the pastel pink and blue UI colors. They are framed within product cards with consistent spacing and subtle shadows or none, maintaining a modern and minimal aesthetic.",
          "buttons": "Buttons are rounded with solid 'primary' blue backgrounds and 'buttonText' pink text. They have subtle shadows or highlights to indicate interactivity. Secondary buttons use outlined styles with 'primary' blue borders and text on a transparent or 'background' color. Buttons maintain consistent padding and font styling for clarity and accessibility."
        },
        "graphicElements": {
          "icons": "Icons are simple line or filled shapes in the 'primary' blue color, maintaining consistency with the brand palette. They are used sparingly for navigation and interactive elements, ensuring clarity without clutter.",
          "illustrations": "No complex illustrations are present; instead, decorative scalloped shapes mimic cookie edges and are used as badges and background elements. These shapes use the 'secondary' pink and 'primary' blue colors to reinforce brand identity playfully.",
          "stickers": "Stickers and badges use scalloped circular shapes in 'badgeBlue' with white or 'background' color text. They often feature rotating or curved text to add a handcrafted, dynamic feel, emphasizing freshness and quality."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1751195444248-Screenshot%202025-06-04%20at%2015.26.38.jpg"
      ]
    },
    {
      "presetId": "31b97f9d-7db9-48fd-8c66-2aea3a9e8e66",
      "brandIdentity": {
        "designSummary": "This brand identity features a bold, modern, and high-contrast visual design centered around a black background that anchors vibrant neon accent colors including purple, lime green, bright blue, pastel pink, soft gray, and vivid orange. The design employs large, geometric sans-serif typography with clean lines and strong presence, often using gradient fills for headlines to enhance the futuristic and dynamic feel. The layout is modular and asymmetrical, combining split sections, horizontal color bars, and scattered polaroid-style images to create a visually engaging and layered composition. Generous negative space and minimal navigation contribute to clarity and focus. The overall aesthetic balances a tech-forward, innovative tone with approachable human elements through informal photo treatments and captions, making it suitable for creative, digital, or technology-driven brands.",
        "toneOfVoice": "Confident, innovative, energetic, and approachable with a modern tech-savvy edge.",
        "tones": [
          "Bold",
          "Futuristic",
          "Energetic",
          "Innovative",
          "High-Contrast",
          "Playful",
          "Approachable",
          "Dynamic",
          "Modern",
          "Clean"
        ],
        "designStyle": {
          "primaryStyle": [
            "Modern",
            "Futuristic",
            "Minimalism"
          ],
          "supportingStyles": [
            "Modular",
            "Asymmetrical",
            "Tech-Inspired",
            "Editorial"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#FFFFFF",
            "secondary": "#5A00FF",
            "secondaryForeground": "#000000",
            "background": "#000000",
            "customColors": [
              {
                "name": "limegreen",
                "value": "#CFFF00"
              },
              {
                "name": "brightblue",
                "value": "#6A8EFF"
              },
              {
                "name": "softgray",
                "value": "#D3D3D3"
              },
              {
                "name": "pastelpink",
                "value": "#DDA0DD"
              },
              {
                "name": "foreground",
                "value": "#ffffff"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' black color as the dominant background to create a high-contrast environment that makes accent colors pop. The 'secondary' purple is ideal for key headings and interactive elements, paired with 'primaryForeground' white for readability. Use 'limeGreen', 'brightBlue', 'softGray', 'pastelPink', and 'vividOrange' as vibrant accent colors for data visualization bars, highlights, and call-to-action elements. These colors should be used in solid blocks or gradients to maintain visual energy and clarity. Text on all the Text on colored backgrounds should use 'secondaryForeground' to ensure accessibility except for Text on 'secondary' background which should use 'Primary FG' to ensure accessibility. The palette supports a futuristic and dynamic brand personality while maintaining legibility and user focus.",
          "paletteAccessibilityNotes": "The 'primaryForeground' white on 'primary' black background provides excellent WCAG AAA contrast. Text in 'secondary' purple on black also meets WCAG AA standards for large text. Accent colors such as 'limeGreen', 'brightBlue', 'pastelPink', and 'vividOrange' on black backgrounds maintain sufficient contrast for accessibility. When using colored bars with black text, ensure the text color is 'secondaryForeground' black on lighter accent backgrounds like 'softGray' and 'limeGreen' to meet WCAG AA contrast ratios."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "work-sans-v2",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "rubik-v2",
              "poppins-v2",
              "open sans"
            ],
            "headingsUsageGuide": "Use the heading font in large sizes for maximum impact, especially for main titles and section headers. Employ gradient fills or solid 'secondary' purple color for emphasis. Headings should be center-aligned or left-aligned depending on layout context. Pair headings with paragraph fonts by maintaining clear hierarchy and spacing to ensure readability. Use ample line height and letter spacing to enhance legibility, especially on dark backgrounds. Headings should always contrast strongly with the background, using 'primaryForeground' or 'secondaryForeground' colors.",
            "headingsAccessibilityNotes": "Headings in 'secondary' purple or white on 'primary' black background meet WCAG AA and AAA contrast standards for all sizes. Ensure gradient text maintains sufficient contrast by testing color stops."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "work-sans-v2",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "open sans",
              "rubik-v2",
              "poppins-v2"
            ],
            "paragraphsUsageGuide": "Use paragraph fonts in smaller sizes with high contrast colors such as 'primaryForeground' white on black or black on lighter accent backgrounds. Maintain consistent line height and letter spacing for comfortable reading. Paragraph text should be left-aligned for natural reading flow. Avoid using paragraph fonts in gradient fills to preserve legibility. Use paragraphs to support headings with clear visual hierarchy and spacing.",
            "paragraphsAccessibilityNotes": "Paragraph text in white on black or black on light accent backgrounds meets WCAG AA contrast requirements. Avoid low contrast color combinations for body text."
          },
          "welcomeSectionTypography": {
            "placement": "Centered",
            "implementation": "The welcome section uses a large, centered headline with gradient text that blends purple and gray tones, placed against a dynamic gradient background. The text is stacked with varying font sizes to create visual hierarchy and emphasis. Below the headline, a smaller, centered subheading in a clean sans-serif font provides context. The entire typographic composition is balanced with generous negative space, ensuring focus and readability while reinforcing the futuristic and energetic brand personality."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.01em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.4",
              "letterSpacing": "0em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.3",
              "letterSpacing": "-0.01em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.03em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.04em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.05em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.06em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.08em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Moderately Complex"
          },
          "grid": {
            "compositionApproach": "Asymmetrical",
            "spacing": {
              "columns": "Flexible columns",
              "rows": "Defined content rows",
              "gaps": "Variable large gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid black backgrounds or vibrant color blocks to segment content clearly. They maintain consistent padding and generous margins to separate sections and enhance readability. Color blocks serve as visual anchors for data and key messages, using accent colors from the palette.",
          "images": "Images are presented in polaroid-style frames with white borders and captions in a monospaced font, adding a casual and human touch. Images are scattered asymmetrically, breaking the grid for a playful effect while maintaining balance.",
          "buttons": "Buttons are minimalistic with solid fills in 'secondary' purple or 'vividOrange' for calls to action. Text on buttons uses 'primaryForeground' white for contrast. Buttons have sharp edges and consistent padding, emphasizing clarity and immediacy."
        },
        "graphicElements": {
          "icons": "Icons, if used, would likely be minimal, geometric, and monochromatic to align with the modern aesthetic. They would use 'primaryForeground' or 'secondary' colors for emphasis.",
          "illustrations": "No illustrations are present; the design relies on photography and typographic graphics. If used, illustrations would be minimal and abstract, using the accent color palette.",
          "stickers": "No stickers or badges are present. If implemented, they would use solid accent colors with clean typography to maintain the brand's modern and bold style."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752422730081-Screenshot%202025-07-13%20at%2019.04.14.png"
      ]
    },
    {
      "presetId": "39d84a83-279d-488c-af90-a7ee265c0e8c",
      "brandIdentity": {
        "designSummary": "This design features a harmonious blend of natural, earthy tones with a restrained and elegant color palette centered on deep forest green, soft beige, and muted yellow accents. The layout is grid-based and balanced, with generous spacing and rounded corners that soften the overall aesthetic. Typography is serif-based, combining elegance with approachability, supporting a wholesome and artisanal brand identity. Buttons and interactive elements use the yellow accent to draw attention subtly, while the dark green provides strong contrast for text and backgrounds. The overall visual style is clean, modern, and nature-inspired, evoking sustainability, calmness, and trustworthiness, suitable for brands emphasizing natural and plant-based products.",
        "toneOfVoice": "Natural, authentic, approachable, and trustworthy with a calm and artisanal personality.",
        "tones": [
          "calm",
          "natural",
          "trustworthy",
          "artisanal",
          "approachable",
          "sustainable",
          "elegant",
          "organic",
          "warm",
          "balanced",
          "clean",
          "authentic",
          "friendly",
          "grounded",
          "refined"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Organic",
            "Modern"
          ],
          "supportingStyles": [
            "Artisanal",
            "Natural",
            "Soft Rounded"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#2B3A2E",
            "primaryForeground": "#D9D6C3",
            "secondary": "#D9D6C3",
            "secondaryForeground": "#2B3A2E",
            "background": "#D9D6C3",
            "customColors": [
              {
                "name": "accentYellow",
                "value": "#E6E27A"
              },
              {
                "name": "darkBackground",
                "value": "#2B3A2E"
              },
              {
                "name": "lightBackground",
                "value": "#D9D6C3"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color for main text, headers, and key UI elements to establish a strong natural presence. The 'secondary' color serves as the base background, providing a soft, warm canvas that supports readability and calmness. The 'primaryForeground' color is used for text on 'primary' backgrounds to ensure legibility. The 'secondaryForeground' is used for text on 'secondary' backgrounds, maintaining contrast and clarity. The 'accentYellow' color is reserved for call-to-action buttons, highlights, and interactive elements to attract attention without disrupting the calm tone. The 'darkBackground' can be used for testimonial sections or footers to create visual separation, with 'lightBackground' text for contrast. Colors should be combined thoughtfully to maintain accessibility and a cohesive natural aesthetic.",
          "paletteAccessibilityNotes": "The 'primary' color (#2B3A2E) on 'secondary' (#D9D6C3) background achieves WCAG AA contrast for body text and headings. The 'accentYellow' (#E6E27A) on 'primary' (#2B3A2E) background meets WCAG AA contrast for buttons and call-to-actions. Text in 'primaryForeground' (#D9D6C3) on 'primary' (#2B3A2E) background also meets WCAG AA standards. The palette ensures sufficient contrast for readability across all text and background combinations used in the design."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "cormorantgaramond",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "bitter",
              "playfair display"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to convey elegance and approachability. Pair with the paragraph font for body text to maintain readability and a cohesive organic feel. Maintain generous line spacing and avoid overly tight letter spacing to preserve clarity. Headings should contrast strongly with backgrounds using the 'primary' or 'darkBackground' colors for emphasis.",
            "headingsAccessibilityNotes": "Headings in 'primary' or 'darkBackground' colors on 'secondary' or 'lightBackground' backgrounds meet WCAG AA contrast standards, ensuring readability for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "nunito sans",
              "raleway",
              "work-sans-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and smaller informational text. It pairs well with the serif heading font to create a balanced typographic hierarchy. Maintain comfortable line height and letter spacing for readability. Text color should primarily be 'primary' or 'secondaryForeground' to ensure contrast against backgrounds.",
            "paragraphsAccessibilityNotes": "Paragraph text colors on their respective backgrounds meet WCAG AA contrast requirements, supporting accessibility and legibility."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a two-column grid with text and image balanced side-by-side. Typography is placed in the left quadrant with ample padding and margin, creating a visual weight that anchors the design. The heading uses the serif font in a large size with the 'primary' color, while supporting text uses the sans-serif font in a smaller size and 'secondaryForeground' color. This placement creates a calm, inviting introduction that draws the eye naturally from text to image."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Moderate Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers have soft rounded corners and use the 'secondary' or 'darkBackground' colors for backgrounds. Padding is generous to create breathing room. Borders are minimal or absent, relying on color blocks to define sections.",
          "images": "Images are presented with rounded corners matching container radii, often paired side-by-side with text. They use natural lighting and warm tones, complementing the color palette. Some images have subtle overlays to enhance text readability.",
          "buttons": "Buttons use the 'accentYellow' color for filled backgrounds with 'primary' color text, or are outlined with 'primary' color and transparent backgrounds. Corners are rounded, and buttons have consistent padding and font styling to maintain a cohesive look."
        },
        "graphicElements": {
          "icons": "Icons are minimal and organic in style, using the 'primary' or 'accentYellow' colors. They complement the natural theme without overwhelming the design.",
          "illustrations": "No prominent illustrations are used; the design relies on photography and minimal graphic motifs such as leaf shapes in 'accentYellow' to reinforce the natural brand identity.",
          "stickers": "Stickers or badges use the 'accentYellow' background with 'primary' text, rounded corners, and simple shapes to highlight key messages or calls to action."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752422579245-Screenshot%202025-07-13%20at%2019.02.30.png"
      ]
    }
  ],
  "designerId": "f6a92210-7855-483d-bddb-1f3d21f30f16",
  "designerName": "Dawn Jacobs",
  "brandBook": {
    "tones": [
      "bold",
      "modern",
      "minimal",
      "energetic",
      "professional",
      "clean",
      "accessible",
      "creative",
      "confident",
      "structured"
    ],
    "designStyle": {
      "primaryStyle": [
        "Minimalism",
        "Modernism"
      ],
      "supportingStyles": [
        "Modular Design",
        "High Contrast",
        "Geometric Typography"
      ]
    },
    "toneOfVoice": "Bold, modern, professional, and creative with a clear and confident personality.",
    "components": {
      "images": "Images are presented in clean rectangular frames with no borders or shadows, maintaining a minimal and modern look. They are spaced generously from text and other elements to avoid clutter and maintain visual balance.",
      "buttons": "Buttons are minimal and functional, typically black with white text or white with black text depending on background context. The 'Get tickets' button uses a black background with white text for prominence. Links are often underlined black text on white or neonAccent backgrounds, maintaining clarity and accessibility.",
      "containers": "Containers use white or neonAccent backgrounds with clear boundaries defined by spacing rather than borders. They maintain consistent padding and margin to separate content blocks, supporting a modular and clean layout. The neonAccent container backgrounds highlight featured content or calls to action, always paired with black text for contrast."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "Primary Heading Font",
          "fontFamily": "barlow-medium",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Use the heading font in uppercase or sentence case with large sizes to create a commanding presence. Pair headings with the paragraph font to maintain readability and balance. Maintain ample spacing around headings to enhance clarity. Use 'primary' color for headings on light backgrounds and 'primaryForeground' on dark backgrounds. Avoid using the neonAccent color for headings to preserve legibility.",
        "headingsSimilarFonts": [
          "montserrat",
          "oswald",
          "avenir-lt-w01_85-heavy1475544"
        ],
        "headingsAccessibilityNotes": "Headings in 'primary' color on 'secondary' background meet WCAG AA and AAA contrast standards. Large font sizes further improve accessibility."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.2",
          "fontWeight": "400"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.3",
          "fontWeight": "400"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.5",
          "fontWeight": "500"
        },
        {
          "name": "xl",
          "size": "1.25rem",
          "letterSpacing": "0em",
          "lineHeight": "1.5",
          "fontWeight": "600"
        },
        {
          "name": "2xl",
          "size": "1.5rem",
          "letterSpacing": "0em",
          "lineHeight": "1.4",
          "fontWeight": "700"
        },
        {
          "name": "3xl",
          "size": "1.875rem",
          "letterSpacing": "-0.01em",
          "lineHeight": "1.3",
          "fontWeight": "700"
        },
        {
          "name": "4xl",
          "size": "2.25rem",
          "letterSpacing": "-0.02em",
          "lineHeight": "1.2",
          "fontWeight": "800"
        },
        {
          "name": "5xl",
          "size": "3rem",
          "letterSpacing": "-0.03em",
          "lineHeight": "1.1",
          "fontWeight": "900"
        },
        {
          "name": "6xl",
          "size": "3.75rem",
          "letterSpacing": "-0.04em",
          "lineHeight": "1.1",
          "fontWeight": "900"
        },
        {
          "name": "7xl",
          "size": "4.5rem",
          "letterSpacing": "-0.05em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "8xl",
          "size": "6rem",
          "letterSpacing": "-0.06em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "-0.07em",
          "lineHeight": "1",
          "fontWeight": "900"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "Main Body Text Font",
          "fontFamily": "barlow-extralight",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Use the paragraph font for body text, captions, and smaller UI elements. Maintain consistent line height and letter spacing for readability. Use 'primary' color for text on 'secondary' backgrounds and 'primaryForeground' on dark backgrounds. Avoid using neonAccent for body text to ensure contrast and legibility.",
        "paragraphsSimilarFonts": [
          "open sans",
          "poppins-v2",
          "nunito sans"
        ],
        "paragraphsAccessibilityNotes": "Body text in 'primary' color on 'secondary' background meets WCAG AA contrast standards for normal text sizes. Larger text sizes meet AAA standards."
      },
      "welcomeSectionTypography": {
        "placement": "Top-Third Anchor",
        "implementation": "The welcome section uses large, bold headings anchored in the top third of the viewport, creating immediate visual impact. The text is left-aligned with generous white space around it, emphasizing clarity and focus. The neonAccent color is used as a background highlight behind key calls to action, contrasting with black text for readability. This placement draws the user's eye naturally from the top navigation down into the content."
      }
    },
    "originImagesUrls": [
      "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752423056465-Screenshot%202025-07-13%20at%2019.10.38.png"
    ],
    "layout": {
      "grid": {
        "margins": "Generous page margins",
        "padding": "Consistent padding within containers",
        "spacing": {
          "gaps": "Consistent medium gaps",
          "rows": "Defined content rows",
          "columns": "12-column grid"
        },
        "compositionApproach": "Modular"
      },
      "layoutDna": {
        "contrastSpectrum": "High-Contrast",
        "densitySpectrum": "Balanced",
        "textVsImageEmphasis": "Balanced",
        "complexitySpectrum": "Simple & Clean",
        "gridAlignmentSpectrum": "Strict Grid",
        "negativeSpaceUsage": "Generous"
      }
    },
    "graphicElements": {
      "icons": "Icons are simple, monochromatic black line or solid shapes consistent with the minimalistic style. They are used sparingly in navigation and UI controls to support usability without visual clutter.",
      "stickers": "No sticker or badge style elements are used; emphasis is created through color blocks and typography.",
      "illustrations": "No decorative illustrations are present; the design relies on photography and abstract art images for visual interest."
    },
    "designSummary": "This brand design embraces a modern, minimalistic aesthetic characterized by a high-contrast black and white base palette punctuated by a vivid neon yellow accent. The layout is grid-based and modular, providing clear content separation and generous white space that enhances readability and visual hierarchy. Typography plays a central role, featuring bold, geometric sans-serif fonts with a clean and slightly technical feel, used in large uppercase headings and medium-weight body text. The neon yellow accent color is strategically applied to navigation backgrounds, call-to-action blocks, and highlighted sections, creating energetic focal points without overwhelming the design. UI components are minimal and functional, with simple black text and icons ensuring clarity and accessibility. Overall, the design conveys professionalism, modernity, and creative vibrancy, suitable for contemporary cultural institutions or brands seeking a bold yet clean visual identity.",
    "palette": {
      "colors": {
        "background": "#FFFFFF",
        "secondary": "#FFFFFF",
        "customColors": [
          {
            "name": "neonaccent",
            "value": "#E6FF00"
          },
          {
            "name": "foreground",
            "value": "#000000"
          }
        ],
        "secondaryForeground": "#000000",
        "primaryForeground": "#FFFFFF",
        "primary": "#000000"
      },
      "paletteUsageGuide": "Use the 'primary' color predominantly for text, icons, and key UI elements on light backgrounds to ensure maximum readability. The 'secondary' color serves as the main background, providing a clean and open canvas. The 'neonAccent' color is reserved for highlighting important interactive elements such as navigation bars, call-to-action blocks, and featured content backgrounds, always paired with 'primary' for text to maintain strong contrast. Avoid using 'neonAccent' for text to preserve legibility. The 'primaryForeground' and 'secondaryForeground' colors ensure text and icons stand out clearly against their respective backgrounds. This palette balances high contrast with vibrant energy, supporting accessibility and user engagement.",
      "paletteAccessibilityNotes": "The combination of 'primary' text on 'secondary' background meets WCAG AA and AAA contrast standards for normal and large text. The 'neonAccent' background with 'primary' text also meets WCAG AA contrast requirements, ensuring readability for call-to-action areas. Black text on white background and vice versa provide optimal contrast. Care should be taken to avoid using 'neonAccent' for small text or low contrast elements to maintain accessibility compliance."
    }
  },
  "initialPrompt": "I want to create a website called Dots  Connecting Arts to Hearts. Purpose: The website should connect Indian artisans and their handmade crafts with a global audience. It should focus on cultural heritage, community, awareness, and online discovery of local art. Design Style: Clean, modern, and minimal with a touch of traditional Indian vibe. Use royal blue for the main navigation ribbon/section header, and grey, turquoise, and white as supporting colors. Fonts should be elegant but readable. Pages & Navigation (all buttons should be clickable and linked): Home  A welcome section with tagline Connecting Arts to Hearts, hero image of Indian crafts, and a CTA button Discover Art. Discover  A grid/gallery to showcase artworks by artisans. Each artwork should open to a detailed page when clicked. Themes  A section for themed collections (e.g., Wedding Art, Festivals, Home Dcor). Custom Requests  A page where visitors can submit personalized art requests (form with name, email, art request details, and upload option). Community  A forum/blog-style section where artisans can share stories, traditions, and behind-the-scenes of their work. About Us  Story of the platform, mission (support artisans, preserve culture, global reach). Contact  Contact form + social media links. Features to enable: All navigation buttons should be working and redirect to respective pages. Enable a shopping/cart option for buying artworks. Make the Custom Requests form functional with email notifications. Add search + filter by category, region, and price. Mobile responsive layout. Additional Goals: Build community engagement, enhance awareness of artisans, and allow easy purchase or customization of Indian art. Please make all buttons, menus, and forms fully functional, not placeholders.Core Features (Amazon-like shopping) Homepage Hero section with tagline: Connecting Arts to Hearts Carousel showing featured artworks / trending Indian artists. Categories (Paintings, Handicrafts, Textiles, Jewelry, Sculptures). Product Listings Page (like Amazon) Grid view with product images, title, artist name, price. Sorting options: By price (Low  High, High  Low) By ratings By popularity By newest Filtering options (sidebar): Price Range (slider) Ratings (stars) Colors (clickable swatches) Materials (wood, metal, fabric, etc.) Region of India (Rajasthan, Kerala, etc.) Product Detail Page Multiple images zoomable (like Amazon). Price + Add to Cart + Buy Now button. Artist story section. Reviews & ratings with images. Similar products recommendations. Custom Art Request Page Form where users submit: Theme (e.g., wedding, festival, modern fusion). Color preferences. Budget. Timeline. Artists get notified to respond with proposals. Cart & Checkout Standard cart view with editable quantities. Secure payment options (UPI, cards, PayPal). Shipping calculation.  Community Features Artist Profiles  showcase bio, portfolio, ratings. Wishlist  users save favorites. Discover Section  New Artists of India & Regional Spotlight. Blog  articles on Indian art history, artist interviews, event updates.  Must-have Buttons (Clickable & Working) Navbar: Home | Categories | Discover | Custom Requests | Community | Cart | Profile/Login Product page: Add to Cart | Buy Now | Wishlist | Share Filters: must apply dynamically (ratings, price, colors, region). Sort dropdown: fully functional. Review submission: star + text + image upload.  Additional Goals Build a community for Indian artists. Increase sales & global reach. Enhance awareness of Indian culture. Offer customized theme-based art for events.I want to create an e-commerce website called Dots  Connecting Arts to Hearts. Purpose: A platform that connects Indian artisans with a global audience, selling handcrafted products like pottery, paintings, wooden dolls, embroidery, jewelry, wall hangings, metal crafts, etc. The website should look modern yet cultural, simple yet interactive. Design Guidelines: Header ribbon: dark royal blue with logo Dots on left, large centered search bar (with dropdown categories), and icons/buttons for Discover, Cart, Be a Seller, Sign in. Use blue, violet, turquoise, grey, and white shades only. Avoid pink. Smooth hover effects, clean fonts, interactive cards. Fully mobile responsive. Homepage Layout: Top Navigation Bar: Search bar in the middle, clickable buttons (Sort By, Trending, Themes, Handicrafts, Customize, New Creations, Settings, Help). Hero Section (Carousel): Large wide image carousel with artisan product banners (like pottery, painting, embroidery). Must resize properly so images dont cut off. Explore Circles (scrollable row): Scrollable horizontal circular category icons  Wedding, Haldi, Shell Art, Paintings, Wooden Dolls, Pottery, Ceramics, Metal Craft, Jewelry, Fridge Magnets, Showpieces, Vintage, etc. (each clickable). Cards Section: Card 1: Explore Art by Themes  button Explore Now Card 2: Explore Traditional Art  button Explore Now Card 3: Discover Section  button Explore Now Card 4: Introducing Communities  Chat with artists & share ideas  Join Now Searching Features: Dropdown search with filters by Artist, Art form, Color, Product. After search  results page with filters on left sidebar (like Amazon): Price ranges Bestsellers Rating Delivery day Relevance Theme checkboxes Product Cards (Search Results Page): Each product card shows: Image, Product Name, Seller Name, Ratings, Offers, Delivery Date, Color option (circle swatches), Tags (Bestseller/New). All buttons clickable  Add to Cart, Wishlist, More Like This. Product Details Page: Left side: multiple angles of product images. Middle: main big photo + wishlist heart icon. Right side: description, cost, offers, ratings, add-to-cart, delivery details. Community Page: A space where users can connect with artisans, share ideas, and learn about traditions. Custom Requests Page: A form where customers can request personalized/custom art from artisans (name, email, request details, upload option). Goals: Increase sales for artisans. Build a global community around Indian art. Showcase Indian culture through crafts in an elegant, trustworthy way. Important: All navigation buttons, filters, search, forms, and product cards should be fully clickable and functional, not placeholders. Smooth user experience like Amazon, but with cultural flavor.",
  "status": "READY",
  "revision": "30",
  "createdDate": "2025-08-22T17:05:07.683Z",
  "updatedDate": "2025-08-22T17:09:38.904Z",
  "attachments": {
    "contentImagesUrls": [],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "1064c6a2-6dfb-4ff3-bd0f-b7a5e4fdc007",
  "plan": "```xml\n<plan>\n  <section>\n    <title>## Overview</title>\n    <content>\nThe app \"Dots  Connecting Arts to Hearts\" connects Indian artisans with a global audience, showcasing their handmade crafts and promoting cultural heritage through an engaging online platform.\n    </content>\n  </section>\n  <section>\n    <title>## Key features</title>\n    <content>\n- **Homepage**: Users can view a hero section with a tagline, featured artworks, and a call-to-action button to discover art.  \n- **Discover Section**: A grid/gallery showcasing artworks by artisans, where each artwork opens to a detailed page upon clicking.  \n- **Custom Requests**: A functional form for users to submit personalized art requests, including name, email, details, and upload option.  \n- **Community Forum**: A blog-style section where artisans can share stories, traditions, and behind-the-scenes insights about their work.  \n- **About Us**: A page detailing the platform's story, mission, and commitment to supporting artisans and preserving culture.  \n- **Contact Form**: A section for users to reach out with inquiries, including a contact form and links to social media.  \n    </content>\n  </section>\n  <section>\n    <title>## Structure</title>\n    <content>\n- **Homepage**: Users can see the welcome section with the tagline, hero image, and a \"Discover Art\" button.  \n- **Discover Section**: Users can browse a grid of artworks, clicking on each to view detailed pages with more information.  \n- **Custom Requests Page**: Users can fill out a form to submit their personalized art requests.  \n- **Community Forum**: Users can read and engage with blog posts from artisans sharing their stories and traditions.  \n- **About Us Page**: Users can learn about the platform's mission and values.  \n- **Contact Page**: Users can fill out a contact form and access social media links.  \n    </content>\n<version>1.2</version>\n  </section>\n</plan>\n```"
}